place_an_order_btn='✔️Оформить заказ'
price_calculator_btn='💴 Калькулятор цен'
yuan_exchange_rate_btn='💹Курс юаня'
instruction_manual_btn='🧐 Инструкция'
support_btn='🖤Поддержка'
delivery_btn='✈️ Доставка'
continue_btn='➡️ Продолжить'
back_btn='🔙 Назад'
main_menu_btn='🔝 Главное Меню'
cancel_btn='🚫 Отмена'
send_btn='✅ Отправить'
agree_btn='👌 Отправить данные'
pre_order_btn='Заказать'

instruction_manual_read='Читать'

main='<strong>{username}, добро пожаловать🔥</strong>\n\n\
Бот рассчитает стоимость и покажет нужную информацию и отправит нам ваши данные для заказа🦾\n\n\
По всем вопросам пишите нам через кнопку «🖤Поддержка»'

order='<strong>🪬Перед добавлением товара ознакомьтесь с инструкцией</strong>'

order_count='<strong>👟👞Введите количество товаров</strong>'

order_cost="<strong>👾Введите стоимость товаров в юанях</strong>\n\n\
👉🏻<a href='https://telegra.ph/Kak-posmotret-stoimost-veshchi-11-04'>Где посмотреть стоимость?</a>"

order_cost_2="<strong>👾Введите стоимость товаров в юанях</strong>\n\n\
*Если их несколько, то введите общую стоимость всех товаров\n\n\
👉🏻<a href='https://telegra.ph/Kak-posmotret-stoimost-veshchi-11-04'>Где посмотреть стоимость?</a>"

instruction='Инструкция'

url_instruction='https://telegra.ph/Kak-oformit-zakaz-cherez-bota-11-20'

order_calc='<strong>😼Расчёт:</strong>\n\
<strong>{total: 0.0f} рублей</strong>\n\
(стоимость вещи по курсу {rate: 0.2f} ¥/₽ и наша комиссия {comission:0.0f} руб. за каждую вещь, оплачивается сразу)\n\
                          ➕\n\
Стоимость доставки из Китая в Москву ✈️\n\
(оплачивается после взвешивания товара на складе в Китае, стоимость исходя из фактического веса - 14$/кг. Если кроссовки, то примерно 1200-1400 руб).'

order_calc_2='<strong>😼Расчёт:\n\
{sum:0.0f} руб.- оплачивается сразу</strong>\n\n\
<i>*Как считали:\n\
{p:0.2f} ¥ (стоимость вещей) * {r:0.2f} ¥/₽ (актуальный курс) \n\
+ наша комиссия {comission:0.0f} руб. *  {c:0.0f} (кол-во вещей)</i>\n\
                          ➕\n\
Стоимость доставки из Китая в Москву ✈️\n\
(оплачивается после взвешивания товара на складе в Китае, стоимость исходя из фактического веса - 14$/кг. Если кроссовки, то примерно 1200-1400 руб).'

pre_order='<strong>🔥Готов сделать заказ?</strong>'


order_continue="<strong>🔗Отправьте ссылки на товары</strong>\n\n\
👉🏻<a href='https://telegra.ph/Kak-skopirovat-ssylku-na-tovar-11-04'>Где найти ссылку?</a>"

order_accept='✔️ Ваша заявка принята!\n\n\
ℹ️ Нажмите кнопку «Отправить»  и наш менеджер свяжется с Вами в ближайшее время.\n\n\
Нажмите «🚫 Отмена», если передумали.'

support_text='Нужна помощь? Напишите @my_poizon_order и мы со всем разберёмся 🖤\n\n\
❗️отвечаем по будням с 18 до 23, по выходным с 12 до 23❗️'

instruction_manual_text='<strong>Короткая инструкция о том, как выбрать размер и заказать через бота🤖</strong>'

delivery_text='Стоимость доставки из Китая в Москву - $ 14 за 1кг.\n\
(Если вы приобретаете кроссовки, то стоимость доставки одной пары выходит примерно 1200-1400р) 👌\n\
                          ➕\n\
Прибавляем стоимость доставки из Москвы до вашего города.\n\
Эта стоимость оплачивается только после того, как товар приедет в Москву, и цена будет рассчитываться уже по факту до вашего адреса (до пункта выдачи СДЭК или до двери курьером, как сами захотите).\n\n\
По стоимости доставки в момент отправки - сориентируем - рассчитать самостоятельно можно здесь https://www.cdek.ru/ru/calculate\n\n\
<i>*А если вы из Москвы, то сможем встретиться лично и не придётся использовать СДЕК🖤</i>'

rate='<strong>💴Актуальный курс:</strong>\n\
1 юань = {r:0.2f} руб.'

rate_info='Откуда эта цифра?'

url_rate='https://telegra.ph/Pro-kurs-yuanya-11-04'

size="<strong>📏Отправьте свой размер</strong>\n\n\
👉🏻<a href='https://telegra.ph/Opredelitsya-s-razmerom-11-04'>Как выбрать размер в приложении?</a>"

agree='<strong>😼Согласны отправить нам свои данные?</strong>'

success_order='<strong>Принято!\n\
Мы свяжемся для подтверждения заказа по будням с 18 до 23, по выходным с 12 до 23 🖤</strong>'

error='<strong>❌ Сбой изменения значения…</strong>\n\n\
Отправленное Значение не является числом.\n\
ℹ️ Введите Числовое Значение…'

error_again='🔄 Попробуйте еще раз…'

order_user = "<strong>Заказ от: <a href='tg://user?id={user}'>{user_full}</a></strong>\n\
<strong>Количество:</strong> {count}\n\
<strong>Стоимоть:</strong> {cost}\n\
<strong>Курс:</strong> {rate:0.2f}\n\
<strong>Сумма:</strong> {total:0.0f}\n\
<strong>Размер:</strong> {size}\n\
<strong>Ссылка:</strong> {link}"